app/controllers/authentication_controller_controller.rb

  def signin

    email=params[:email]
    password=params[:password]

    user=User.find_by_email(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "manish"]]

  def signup
    email=params[:email]
    password=params[:password]
    user=User.find_by_email(email)
    unless user
      user=User.create(email:email,password:password)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "manish"]]
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "manish"], ["password", "123"], ["created_at", "2017-03-22 06:58:58.568187"], ["updated_at", "2017-03-22 06:58:58.568187"]]